Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J19A.atdf
        <module name="GMAC" id="U2005" version="1.0.0">
          <instance name="GMAC">
            <register-group name="GMAC" name-in-module="GMAC" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="GCRS" function="L" pad="PA16"/>
              <signal group="GMDC" function="L" pad="PA20"/>
              <signal group="GMDC" function="L" pad="PB14"/>
              <signal group="GMDIO" function="L" pad="PA21"/>
              <signal group="GMDIO" function="L" pad="PB15"/>
              <signal group="GRX" index="0" function="L" pad="PA13"/>
              <signal group="GRX" index="1" function="L" pad="PA12"/>
              <signal group="GRXER" function="L" pad="PA15"/>
              <signal group="GTX" index="0" function="L" pad="PA18"/>
              <signal group="GTX" index="1" function="L" pad="PA19"/>
              <signal group="GTXCK" function="L" pad="PA14"/>
              <signal group="GTXEN" function="L" pad="PA17"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.4">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x4100C000"/>
            <parameters>
              <param name="MASTER_NUM" value="8"/>
              <param name="MASTER_CM4_S" value="0"/>
              <param name="MASTER_CMCC" value="1"/>
              <param name="MASTER_PICOP_MEM" value="2"/>
              <param name="MASTER_PICOP_IO" value="3"/>
              <param name="MASTER_DMAC_DTWR" value="4"/>
              <param name="MASTER_DMAC_DTRD" value="5"/>
              <param name="MASTER_ICM" value="6"/>
              <param name="MASTER_DSU" value="7"/>
              <param name="SLAVE_NUM" value="14"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_FLASH_ALT" value="1"/>
              <param name="SLAVE_SEEPROM" value="2"/>
              <param name="SLAVE_RAMCM4S" value="3"/>
              <param name="SLAVE_RAMPPPDSU" value="4"/>
              <param name="SLAVE_RAMDMAWR" value="5"/>
              <param name="SLAVE_RAMDMACICM" value="6"/>
              <param name="SLAVE_HPB0" value="7"/>
              <param name="SLAVE_HPB1" value="8"/>
              <param name="SLAVE_HPB2" value="9"/>
              <param name="SLAVE_HPB3" value="10"/>
              <param name="SLAVE_SDHC0" value="12"/>
              <param name="SLAVE_QSPI" value="14"/>
              <param name="SLAVE_BKUPRAM" value="15"/>
              <param name="INSTANCE_ID" value="38"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="U2010" version="1.2.0">
          <instance name="ICM">
            <register-group name="ICM" name-in-module="ICM" address-space="base" offset="0x42002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="I2S" id="U2224" version="2.0.0">
          <instance name="I2S">
            <register-group name="I2S" name-in-module="I2S" address-space="base" offset="0x43002800"/>
            <signals>
              <signal group="FS" index="0" function="J" pad="PA09"/>
              <signal group="FS" index="0" function="J" pad="PA20"/>
              <signal group="FS" index="1" function="J" pad="PA23"/>
              <signal group="FS" index="1" function="J" pad="PB11"/>
              <signal group="MCK" index="0" function="J" pad="PA08"/>
              <signal group="MCK" index="0" function="J" pad="PB17"/>
              <signal group="MCK" index="1" function="J" pad="PB13"/>
              <signal group="SCK" index="0" function="J" pad="PA10"/>
              <signal group="SCK" index="0" function="J" pad="PB16"/>
              <signal group="SCK" index="1" function="J" pad="PB12"/>
              <signal group="SDI" function="J" pad="PA22"/>
              <signal group="SDI" function="J" pad="PB10"/>
              <signal group="SDO" function="J" pad="PA11"/>
              <signal group="SDO" function="J" pad="PA21"/>
            </signals>
            <parameters>
              <param name="CLK_NUM" value="2"/>
              <param name="MAX_SLOTS" value="8"/>
              <param name="MAX_WL_BITS" value="32"/>
              <param name="SER_NUM" value="2"/>
              <param name="INSTANCE_ID" value="106"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2408" version="1.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="SYSTEM_CLOCK" value="48000000"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="HPB3" bit="3"/>
                <clock name="DSU" bit="4"/>
                <clock name="HMATRIX" bit="5"/>
                <clock name="NVMCTRL" bit="6"/>
                <clock name="HSRAM" bit="7"/>
                <clock name="CMCC" bit="8"/>
                <clock name="DMAC" bit="9"/>
                <clock name="USB" bit="10"/>
                <clock name="BKUPRAM" bit="11"/>
                <clock name="PAC" bit="12"/>
                <clock name="QSPI" bit="13"/>
                <clock name="GMAC" bit="14"/>
                <clock name="SDHC0" bit="15"/>
                <clock name="ICM" bit="19"/>
                <clock name="PUKCC" bit="20"/>
                <clock name="QSPI_2X" bit="21"/>
                <clock name="NVMCTRL_SMEEPROM" bit="22"/>
                <clock name="NVMCTRL_CACHE" bit="23"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2409" version="1.0.0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="BLOCK_SIZE" value="8192"/>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGES" value="1024"/>
              <param name="PAGES_PR_REGION" value="64"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2409" version="1.0.0">
          <instance name="FUSES">
            <register-group name="SW0_FUSES" name-in-module="SW0_FUSES" address-space="fuses" offset="0x00800080"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00800100"/>
