Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J19A.atdf
        <module name="SUPC" id="U2407" version="1.0.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="OUT" index="0" function="SUPC" pad="PB01"/>
              <signal group="OUT" index="1" function="SUPC" pad="PB02"/>
              <signal group="VBAT" function="SUPC" pad="PB03"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="TAL" id="U2253" version="2.0.0">
          <instance name="TAL">
            <register-group name="TAL" name-in-module="TAL" address-space="base" offset="0x4101E000"/>
            <signals>
              <signal group="BRK" function="H" pad="PA27"/>
              <signal group="BRK" function="H" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CPU_NUM" value="2"/>
              <param name="CTI_NUM" value="4"/>
              <param name="DMA_CH_NUM" value="32"/>
              <param name="EV_CH_NUM" value="12"/>
              <param name="EXTINT_NUM" value="16"/>
              <param name="ID_IN_INTCPUSEL" value="1"/>
              <param name="ID_NUM" value="130"/>
              <param name="INT_GRP_NUM" value="5"/>
              <param name="INT_NUM" value="137"/>
              <param name="INT_NUM_BITS" value="8"/>
              <param name="IPS_GRP_NUM" value="2"/>
              <param name="IPS_NUM" value="64"/>
              <param name="IRQMON_NUM" value="1"/>
              <param name="INSTANCE_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="44"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="9"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="14"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="47"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="9"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x4101A000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
              <signal group="WO" index="1" function="E" pad="PA13"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="50"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="45"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x4101C000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="53"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="26"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="46"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="56"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="30"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="59"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="30"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.1.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x41016000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PA20"/>
              <signal group="WO" index="0" function="G" pad="PB12"/>
              <signal group="WO" index="0" function="F" pad="PA08"/>
              <signal group="WO" index="1" function="G" pad="PA21"/>
              <signal group="WO" index="1" function="G" pad="PB13"/>
              <signal group="WO" index="1" function="F" pad="PA09"/>
              <signal group="WO" index="2" function="G" pad="PA22"/>
              <signal group="WO" index="2" function="G" pad="PB14"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="3" function="G" pad="PA23"/>
              <signal group="WO" index="3" function="G" pad="PB15"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="4" function="G" pad="PA16"/>
              <signal group="WO" index="4" function="G" pad="PB16"/>
              <signal group="WO" index="4" function="F" pad="PB10"/>
              <signal group="WO" index="5" function="G" pad="PA17"/>
              <signal group="WO" index="5" function="G" pad="PB17"/>
              <signal group="WO" index="5" function="F" pad="PB11"/>
              <signal group="WO" index="6" function="G" pad="PA18"/>
              <signal group="WO" index="6" function="G" pad="PB30"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="7" function="G" pad="PA19"/>
              <signal group="WO" index="7" function="G" pad="PB31"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="22"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="25"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="43"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x41018000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PB10"/>
              <signal group="WO" index="0" function="F" pad="PA16"/>
              <signal group="WO" index="1" function="G" pad="PB11"/>
              <signal group="WO" index="1" function="F" pad="PA17"/>
              <signal group="WO" index="2" function="G" pad="PA12"/>
              <signal group="WO" index="2" function="G" pad="PA14"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="G" pad="PA13"/>
              <signal group="WO" index="3" function="G" pad="PA15"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="G" pad="PA08"/>
              <signal group="WO" index="4" function="F" pad="PA20"/>
              <signal group="WO" index="5" function="G" pad="PA09"/>
              <signal group="WO" index="5" function="F" pad="PA21"/>
              <signal group="WO" index="6" function="G" pad="PA10"/>
              <signal group="WO" index="6" function="F" pad="PA22"/>
              <signal group="WO" index="7" function="G" pad="PA11"/>
              <signal group="WO" index="7" function="F" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="29"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="25"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="44"/>
            </parameters>
          </instance>
