Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J19A.atdf
      <value-group name="RTC_TAMPCTRL__IN0ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN0 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN1ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN1 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN2ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN2 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN3ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN3 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN4ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN4 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN5ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN5 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN6ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN6 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_TAMPCTRL__IN7ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0"/>
        <value name="WAKE" caption="Wake without timestamp" value="0x1"/>
        <value name="CAPTURE" caption="Capture timestamp" value="0x2"/>
        <value name="ACTL" caption="Compare IN7 to OUT" value="0x3"/>
      </value-group>
      <value-group name="RTC_MODE2_TIMESTAMP__HOUR">
        <value name="AM" caption="AM when CLKREP in 12-hour" value="0x00"/>
        <value name="PM" caption="PM when CLKREP in 12-hour" value="0x10"/>
      </value-group>
    </module>
    <module name="SDHC" id="U2011" version="1.8.3" caption="SD/MMC Host Controller">
      <register-group name="SDHC" caption="SD/MMC Host Controller">
        <register name="SSAR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="SDMA System Address / Argument 2">
          <mode name="CMD23">
            <bitfield name="ARG2" caption="Argument 2" mask="0xFFFFFFFF"/>
          </mode>
          <mode name="DEFAULT_MODE">
            <bitfield name="ADDR" caption="SDMA System Address" mask="0xFFFFFFFF"/>
          </mode>
        </register>
        <register name="BSR" offset="0x4" rw="RW" size="2" initval="0x0000" caption="Block Size">
          <bitfield name="BLOCKSIZE" caption="Transfer Block Size" mask="0x3FF"/>
          <bitfield name="BOUNDARY" caption="SDMA Buffer Boundary" mask="0x7000" values="SDHC_BSR__BOUNDARY"/>
        </register>
        <register name="BCR" offset="0x6" rw="RW" size="2" initval="0x0000" caption="Block Count">
          <bitfield name="BCNT" caption="Blocks Count for Current Transfer" mask="0xFFFF"/>
        </register>
        <register name="ARG1R" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Argument 1">
          <bitfield name="ARG" caption="Argument 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="TMR" offset="0xC" rw="RW" size="2" initval="0x0000" caption="Transfer Mode">
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x1" values="SDHC_TMR__DMAEN"/>
          <bitfield name="BCEN" caption="Block Count Enable" mask="0x2" values="SDHC_TMR__BCEN"/>
          <bitfield name="ACMDEN" caption="Auto Command Enable" mask="0xC" values="SDHC_TMR__ACMDEN"/>
          <bitfield name="DTDSEL" caption="Data Transfer Direction Selection" mask="0x10" values="SDHC_TMR__DTDSEL"/>
          <bitfield name="MSBSEL" caption="Multi/Single Block Selection" mask="0x20" values="SDHC_TMR__MSBSEL"/>
        </register>
        <register name="CR" offset="0xE" rw="RW" size="2" initval="0x0000" caption="Command">
          <bitfield name="RESPTYP" caption="Response Type" mask="0x3" values="SDHC_CR__RESPTYP"/>
          <bitfield name="CMDCCEN" caption="Command CRC Check Enable" mask="0x8" values="SDHC_CR__CMDCCEN"/>
          <bitfield name="CMDICEN" caption="Command Index Check Enable" mask="0x10" values="SDHC_CR__CMDICEN"/>
          <bitfield name="DPSEL" caption="Data Present Select" mask="0x20" values="SDHC_CR__DPSEL"/>
          <bitfield name="CMDTYP" caption="Command Type" mask="0xC0" values="SDHC_CR__CMDTYP"/>
          <bitfield name="CMDIDX" caption="Command Index" mask="0x3F00"/>
        </register>
        <register name="RR" offset="0x10" rw="R" size="4" count="4" initval="0x00000000" caption="Response">
          <bitfield name="CMDRESP" caption="Command Response" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDPR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Buffer Data Port">
          <bitfield name="BUFDATA" caption="Buffer Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="PSR" offset="0x24" rw="R" size="4" initval="0x00F80000" caption="Present State">
          <bitfield name="CMDINHC" caption="Command Inhibit (CMD)" mask="0x1" values="SDHC_PSR__CMDINHC"/>
          <bitfield name="CMDINHD" caption="Command Inhibit (DAT)" mask="0x2" values="SDHC_PSR__CMDINHD"/>
          <bitfield name="DLACT" caption="DAT Line Active" mask="0x4" values="SDHC_PSR__DLACT"/>
          <bitfield name="RTREQ" caption="Re-Tuning Request" mask="0x8" values="SDHC_PSR__RTREQ"/>
          <bitfield name="WTACT" caption="Write Transfer Active" mask="0x100" values="SDHC_PSR__WTACT"/>
          <bitfield name="RTACT" caption="Read Transfer Active" mask="0x200" values="SDHC_PSR__RTACT"/>
          <bitfield name="BUFWREN" caption="Buffer Write Enable" mask="0x400" values="SDHC_PSR__BUFWREN"/>
          <bitfield name="BUFRDEN" caption="Buffer Read Enable" mask="0x800" values="SDHC_PSR__BUFRDEN"/>
          <bitfield name="CARDINS" caption="Card Inserted" mask="0x10000" values="SDHC_PSR__CARDINS"/>
          <bitfield name="CARDSS" caption="Card State Stable" mask="0x20000" values="SDHC_PSR__CARDSS"/>
          <bitfield name="CARDDPL" caption="Card Detect Pin Level" mask="0x40000" values="SDHC_PSR__CARDDPL"/>
          <bitfield name="WRPPL" caption="Write Protect Pin Level" mask="0x80000" values="SDHC_PSR__WRPPL"/>
          <bitfield name="DATLL" caption="DAT[3:0] Line Level" mask="0xF00000"/>
          <bitfield name="CMDLL" caption="CMD Line Level" mask="0x1000000"/>
        </register>
